from pathlib import Path


class Constants:
    OPENING_STATEMENTS = [
        "สวัสดีครับ",
        "สวัสดีค่ะ มาเจอกันอีกทีที่สถานีวิทยุของเรา",
        "สวัสดีทุกคนครับ พร้อมที่จะทำให้วันนี้เต็มไปด้วยเพลงเพราะ",
        "สวัสดีค่ะทุกคน มีความสุขมากที่ได้เจอกันในที่นี้",
        "สวัสดีครับทุกคน มีความยินดีที่ได้เป็นส่วนหนึ่งของวงการวิทยุ",
        "สวัสดีค่ะทุกคน พร้อมที่จะเปิดเสียงดนตรีสำหรับคุณ เพลง",
        "สวัสดีครับทุกคน มีเพลงเพราะๆ รอคุณอยู่",
        "สวัสดีค่ะทุกคน มาพร้อมกับเพลงที่ทำให้คุณลืมทุกวัน",
    ]
    OPENNING_OUTDIR = Path("dl/openning")

    ENDING_STATEMENTS = [
        "ขอบคุณทุกคนที่ร่วมฟังเราวันนี้ หวังว่าคุณจะมีวันที่สดใส และเราจะพบกันใหม่ในครั้งถัดไปค่ะ",
        "ขอบคุณทุกคนที่ทำให้วันนี้เต็มไปด้วยความสุข ลาก่อนค่ะ หวังว่าเราจะได้เจอกันอีกในเร็วๆ นี้",
        "ถึงตรงนี้แล้วนะค่ะ ขอบคุณทุกคนที่ร่วมสนุกกับเรา ลาก่อนและหวังว่าคุณจะมีคืนที่สุข",
        "ขอบคุณทุกคนที่ทำให้วันนี้เป็นวันที่น่าจดจำ เราจะไปพบกับคุณในรอบต่อไป ลาก่อนค่ะ",
        "มาถึงจุดสุดท้ายของรายการวันนี้แล้วค่ะ ขอบคุณทุกคนที่ร่วมฟัง ลาก่อนและหวังว่าคุณจะมีคืนที่สนุกสุข",
    ]
    ENDING_OUTDIR = Path("dl/ending")

    EMPTY_STATEMENTS = [
        "เพลงหมดแล้ว ขอเพลงเพิ่มด่วน",
    ]
    EMPTY_OUTDIR = Path("dl/empty")

    ALL_STATEMENTS = [
        (OPENING_STATEMENTS, OPENNING_OUTDIR),
        (ENDING_STATEMENTS, ENDING_OUTDIR),
        (EMPTY_STATEMENTS, EMPTY_OUTDIR),
    ]

    SONGDIR = Path("dl/songs")
